//LeetCode    461.汉明距离

/*
int hammingDistance(int x, int y) {
    //获得x与y不同的二进制位
    int n = x ^ y;
    //统计不同二进制位的个数
    //01    10
    n = (n & 0x55555555) + ((n >> 1) & 0x55555555); //二分
    //0011    1100
    n = (n & 0x33333333) + ((n >> 2) & 0x33333333); //四分
    //00001111    11110000
    n = (n & 0x0f0f0f0f) + ((n >> 4) & 0x0f0f0f0f); //八分
    //1111111100000000    1111111100000000
    n = (n & 0x00ff00ff) + ((n >> 8) & 0x00ff00ff); //十六分
    //00000000000000001111111111111111    11111111111111110000000000000000
    n = (n & 0x0000ffff) + ((n >> 16) & 0x0000ffff); //三十二分
    return n;
}
*/